Examinator/src/Documents/ПопыткаВыполненияПодборкиВопросовСУЗ/ПопыткаВыполненияПодборкиВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияПодборкиВопросовСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>DefinedType.ВариантЗаданияЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Подборка</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполненияТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговыйРезультат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <comment>Отведенное на выполнение время теста</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБалловПсихологическихВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическийВопрос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесВопроса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементПодборкиИзРубрикатора</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиИзРубрикатораСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПодборки</name>
    <comment>Сохраняются группы подборки (элементы подборки верхнего уровня, которые образует ее страницы), которые были на момент начала сессии теста. В ссылках параметр numGroup</comment>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсеВопросыОтвечены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВопросыНаПроверку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ОтветНаВопросСУЗ/ОтветНаВопросСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтветНаВопросСУЗ</name>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <attributes>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоПоказаВопроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПоказаВопроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияВопроса</name>
    <comment>УДАЛИТЬ</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фасет</name>
    <type>
      <types>CatalogRef.ФасетыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросОтвечен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутыйОтветПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованаПодсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БаллЗаПсихологическийВопрос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПсихологическийВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>ВариантОтвета</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВарианта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыбраннаяГруппа</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыбраннаяКатегория</name>
      <type>
        <types>CatalogRef.КатегорииВариантовОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияВарианта</name>
      <comment>Номер позиции для вопросов типа Последовательность</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерныйВыбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерныйНеВыбран</name>
      <comment>Равно Истина, если вариант верный, но не был выбран пользователем.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибочныйВыбран</name>
      <comment>Равно Истина, если вариант является дистрактором и был выбран.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибочныйНеВыбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыВариантовОтветов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииВариантовОтветов</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииВариантовОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКатегории</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветыПоШаблону</name>
    <comment>Используется в вопросах типа &quot;По шаблону&quot;</comment>
    <attributes>
      <name>ГруппаВариантов</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОтвета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияОтветовНаВопрос</name>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РазвернутыйОтветПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверенПреподавателем</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверившийПреподаватель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыПопытки</name>
      <comment>Дата, когда пользователь нажал кнопку &quot;Повторить ответ&quot;</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомментария</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальныеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВебСсылка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПопыткаВыполненияПодборкиВопросовСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС
	
Функция СессииТестирования(Пользователь, ПрохождениеОбучения=Неопределено, Задание=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Дата,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.ИтоговыйРезультат,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Подборка.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Проведен = ИСТИНА
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.Пользователь = &Пользователь
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.ТестЗавершен = ИСТИНА
		|   И ПопыткаВыполненияПодборкиВопросовСУЗ.Отменено = ЛОЖЬ";
		
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
		Запрос.Текст = Запрос.Текст + "	И ПопыткаВыполненияПодборкиВопросовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения";
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Задание) Тогда
		
		Запрос.Текст = Запрос.Текст + " И ПопыткаВыполненияПодборкиВопросовСУЗ.Задание = &Задание";
		Запрос.УстановитьПараметр("Задание", Задание);
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СтоимостьВопросаТеста(Вопрос, Тест) Экспорт
	
	Если ТипЗнч(Тест) = Тип("ДокументСсылка.ПопыткаВыполненияПодборкиВопросовСУЗ")
		И ЗначениеЗаполнено(Тест)
		И ЗначениеЗаполнено(Вопрос) Тогда
		
		ТаблицаВопросов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тест, "Вопросы").Выгрузить();
		
		Возврат СтоимостьВопроса(Вопрос, ТаблицаВопросов);
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция СтоимостьВопроса(Вопрос, ВопросыТеста) Экспорт
	
	// ВопросыТеста - табличная часть Вопросы документа
	
	ВопросВСессии = ВопросыТеста.Найти(Вопрос, "Вопрос");
	
	Если ВопросВСессии = Неопределено Тогда 
		ВесВопроса = 1;
	Иначе
		ВесВопроса = ВопросВСессии.ВесВопроса;
	КонецЕсли;
	
	СуммаВсехВесов = СуммаВесовВопросов(ВопросыТеста);
	
	Если СуммаВсехВесов > 0 Тогда	
		Возврат Окр((ВесВопроса / СуммаВсехВесов) * 100, 2);
	Иначе
		Возврат 1;
	КонецЕсли;
	
	
КонецФункции

Функция СуммаВесовВопросов(ВопросыТеста) Экспорт
	
	СуммаВсехВесов = 0;
	
	Для каждого СтрокаТЧВ Из ВопросыТеста Цикл
		
		Если НЕ СтрокаТЧВ.ПсихологическийВопрос Тогда
			СуммаВсехВесов = СуммаВсехВесов + СтрокаТЧВ.ВесВопроса;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СуммаВсехВесов;
	
КонецФункции

Функция ВопросыТеста(СессияВыполненияТеста) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Вопрос КАК Вопрос,
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Вопрос.Наименование КАК Наименование,
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.НомерСтроки КАК Номер,
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.ВесВопроса КАК Вес,
		|	ОтветНаВопросСУЗ.ВопросОтвечен КАК ВопросОтвечен,
		|	ОтветНаВопросСУЗ.Результат КАК Результат,
		|	ОтветНаВопросСУЗ.Ссылка КАК ОтветНаВопрос
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ.Вопросы КАК ПопыткаВыполненияПодборкиВопросовСУЗВопросы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|		ПО ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Ссылка = ОтветНаВопросСУЗ.СессияВыполненияТеста
		|			И ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Вопрос = ОтветНаВопросСУЗ.Вопрос
		|			И (ОтветНаВопросСУЗ.Отменено = ЛОЖЬ)
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Ссылка = &СессияВыполненияТеста
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Запрос.УстановитьПараметр("СессияВыполненияТеста", СессияВыполненияТеста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ДанныеТестированияДляПросмотра(СессияВыполненияТеста, ГруппаПодборки=Неопределено) Экспорт

	НастройкиТестирования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СессияВыполненияТеста, "ПоказыватьНавигацию, Пользователь, Подборка, ЭлементСодержанияСводаЗнаний, СводЗнаний");
	
	ДопСвойстваСсылки = Новый Структура;
	
	Если ГруппаПодборки <> Неопределено Тогда
		
		Если ТипЗнч(ГруппаПодборки) = Тип("Число") Тогда
			ДопСвойстваСсылки.Вставить("НомерГруппыПодборки", ГруппаПодборки);
		Иначе
			ДопСвойстваСсылки.Вставить("ЭлементПодборки", ГруппаПодборки);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопСвойстваСсылки.Вставить("ДокументСессии", СессияВыполненияТеста);
	ДопСвойстваСсылки.Вставить("РазрешенПереходКВопросамТеста", Истина);
	
	СсылкаНаТест = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НастройкиТестирования.Подборка,,,ДопСвойстваСсылки);
	
	НастройкиТестирования.Вставить("СсылкаНаЭлемент", СсылкаНаТест);
	
	Возврат НастройкиТестирования;
	
КонецФункции

#КонецОбласти


#КонецЕсли
